Heatsink study of a FPV Drone/gemFan_Cases/mesh/mesh_0/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     chtMultiRegionSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100;//200;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;//binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

functions
{
    //#include    "probes"
    yPlus_air
    {
    	type	yPlus;
    	libs	("libfieldFunctionObjects.so");
    	
    	executeControl writeTime;
    	writeControl   writeTime;
    	region air;
    }
    
    heatTrfCoeff
    {
    	type	       heatTransferCoeff;
    	libs	       ("libfieldFunctionObjects.so");
   
    	executeControl writeTime;
    	writeControl   writeTime;
    	region         air;
    	htcModel       fixedReferenceTemperature;
    	patches        ("air_to_heatSink");
    	field          T;
    	TRef           300;
    }
}


// ************************************************************************* //
