Heatsink study of a FPV Drone/gemFan_Cases/mesh/mesh_0/constant/air/MRFProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      MRFProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rps 628.31; // rads per second - 6000 rpm

VC_1
{
    cellZone        cellMRFZone1;
    active          true;
    nonRotatingPatches ();
    origin          (-0.075 0.075 0.0);
    axis            (0 0 1);
    omega           -$rps;
}

VC_2
{
    cellZone        cellMRFZone2;
    active          true;
    nonRotatingPatches ();
    origin          (0.075 0.075 0.0);
    axis            (0 0 1);
    omega           $rps;
}

VC_3
{
    cellZone        cellMRFZone3;
    active          true;
    nonRotatingPatches ();
    origin          (0.075 -0.075 0.0);
    axis            (0 0 1);
    omega           -$rps;
}

VC_4
{
    cellZone        cellMRFZone4;
    active          true;
    nonRotatingPatches ();
    origin          (-0.075 -0.075 0.0);
    axis            (0 0 1);
    omega           $rps;
}


// ************************************************************************* //
